<?php
$cate1[100000] = array('name' => "农、林、牧、渔业", 'keyword' => '');
$cate1[200000] = array('name' => "采矿业", 'keyword' => '');
$cate1[300000] = array('name' => "制造业", 'keyword' => '');
$cate1[400000] = array('name' => "电力、热力、燃气及水生产和供应业", 'keyword' => '');
$cate1[500000] = array('name' => "建筑业", 'keyword' => '');
$cate1[600000] = array('name' => "批发和零售业", 'keyword' => '');
$cate1[700000] = array('name' => "交通运输、仓储和邮政业", 'keyword' => '');
$cate1[800000] = array('name' => "住宿和餐饮业", 'keyword' => '');
$cate1[900000] = array('name' => "信息传输、软件和信息技术服务业", 'keyword' => '');
$cate1[101000] = array('name' => "金融业", 'keyword' => '');
$cate1[110000] = array('name' => "房地产业", 'keyword' => '');
$cate1[120000] = array('name' => "租赁和商务服务业", 'keyword' => '');
$cate1[130000] = array('name' => "科学研究和技术服务业", 'keyword' => '');
$cate1[140000] = array('name' => "水利、环境和公共设施管理业", 'keyword' => '');
$cate1[150000] = array('name' => "居民服务、修理和其他服务业", 'keyword' => '');
$cate1[160000] = array('name' => "教育", 'keyword' => '');
$cate1[170000] = array('name' => "卫生和社会工作", 'keyword' => '');
$cate1[180000] = array('name' => "文化、体育和娱乐业", 'keyword' => '');
$cate1[190000] = array('name' => "公共管理、社会保障和社会组织", 'keyword' => '');

$cate2[100001] = array('name' => "农业", 'keyword' => '种植|谷物及其他作物的种植|谷物的种植|薯类的种植|油料的种植|豆类的种植|棉花的种植|麻类的种植|糖料的种植|烟草的种植|其他作物的种植|蔬菜、园艺作物的种植|蔬菜的种植|花卉的种植|其他园艺作物的种植|水果、坚果、饮料和香料作物的种植|水果、坚果的种植|茶及其他饮料作物的种植|香料作物的种植|中药材的种植');
$cate2[100002] = array('name' => "林业", 'keyword' => '林木|木材|林木的培育和种植|育种和育苗|造林|林木的抚育和管理|木材和竹材的采运|木材的采运|竹材的采运|林产品的采集');
$cate2[100003] = array('name' => "畜牧业", 'keyword' => '牲畜|家禽|牲畜的饲养|猪的饲养|家禽的饲养|狩猎和捕捉动物');
$cate2[100004] = array('name' => "渔业", 'keyword' => '渔业|海洋渔业|海水养殖|海洋捕捞|内陆渔业|内陆养殖|内陆捕捞');
$cate2[100005] = array('name' => "农、林、牧、渔服务业", 'keyword' => '农业服务业|灌溉服务|农产品初加工服务|其他农业服务|林业服务业|畜牧服务业|兽医服务|其他畜牧服务|渔业服务业');

$cate2[200001] = array('name' => "煤炭开采和洗选业", 'keyword' => '烟煤和无烟煤的开采洗选|褐煤的开采洗选|其他煤炭的开采洗选');
$cate2[200002] = array('name' => "石油和天然气开采业", 'keyword' => '天然原油开采|天然气开采|与石油和天然气开采有关的服务活动');
$cate2[200003] = array('name' => "黑色金属矿采选业", 'keyword' => '铁矿采选|其他黑色金属矿采选');
$cate2[200004] = array('name' => "有色金属矿采选业", 'keyword' => '常用有色金属矿采选|铜矿采选|铅锌矿采选|镍钴矿采选|锡矿采选|锑矿采选|铝矿采选|镁矿采选|其他常用有色金属矿采选|贵金属矿采选|金矿采选|银矿采选|其他贵金属矿采选|稀有稀土金属矿采选|钨钼矿采选|稀土金属矿采选|放射性金属矿采选|其他稀有金属矿采选');
$cate2[200005] = array('name' => "非金属矿采选业", 'keyword' => '土砂石开采|石灰石、石膏开采|建筑装饰用石开采|耐火土石开采|粘土及其他土砂石开采|化学矿采选|采盐|石棉及其它非金属矿采选|石棉、云母矿采选|石墨、滑石采选|宝石、玉石开采|其他非金属矿采选');
$cate2[200006] = array('name' => "开采辅助活动", 'keyword' => '煤炭开采和洗选辅助活动|石油和天然气开采辅助活动|其他开采辅助活动');
$cate2[200007] = array('name' => "其他采矿业", 'keyword' => '其他采矿业');

$cate2[300001] = array('name' => "农副食品加工业", 'keyword' => '谷物磨制|饲料加工|植物油加工|食用植物油加工|非食用植物油加工|制糖|屠宰及肉类加工|畜禽屠宰|肉制品及副产品加工|水产品加工|水产品冷冻加工|鱼糜制品及水产品干腌制加工|水产饲料制造|鱼油提取及制品的制造|其他水产品加工|蔬菜、水果和坚果加工|其他副食品加工|淀粉及淀粉制品的制造|豆制品制造|蛋品加工|其他未列明的农副食品加工');
$cate2[300002] = array('name' => "食品制造业", 'keyword' => '焙烤食品制造|糕点、面包制造|饼干及其他焙烤食品制造|糖果、巧克力及蜜饯制造|糖果、巧克力制造|蜜饯制造|方便食品制造|米、面制品制造|速冻食品制造|方便面及其他方便食品制造|液体乳及乳制品制造|罐头制造|肉、禽类罐头制造|水产品罐头制造|蔬菜、水果罐头制造|其他罐头食品制造|调味品、发酵制品制造|味精制造|酱油、食醋及类似制品的制造|其他调味品、发酵制品制造|其他食品制造|营养、保健品制造|冷冻饮品及食用冰制造|盐加工|食品及饲料添加剂制造|其他未列明的食品制造');
$cate2[300003] = array('name' => "酒、饮料喝精制茶制造业", 'keyword' => '酒精制造|酒的制造|白酒制造|啤酒制造|黄酒制造|葡萄酒制造|其他酒制造|软饮料制造|碳酸饮料制造|瓶（罐）装饮用水制造|果菜汁及菜汁饮料制造|含乳饮料和植物蛋白饮料制造|固体饮料制造|茶饮料及其他软饮料制造|精制茶加工');
$cate2[300004] = array('name' => "烟草制造业", 'keyword' => '烟叶复烤|卷烟制造|其他烟草制品加工');
$cate2[300005] = array('name' => "纺织业", 'keyword' => '棉、化纤纺织及印染精加工|棉、化纤纺织加工|棉、化纤印染精加工|毛纺织和染整精加工|毛条加工|毛纺织|毛染整精加工|麻纺织|丝绢纺织及精加工|缫丝加工|绢纺和丝织加工|丝印染精加工|纺织制成品制造|棉及化纤制品制造|毛制品制造|麻制品制造|丝制品制造|绳、索、缆的制造|纺织带和帘子布制造|无纺布制造|其他纺织制成品制造|针织品、编织品和其他织品制造|棉、化纤针织品及编织品制造|毛针织品及编织品制造|丝针织品及编织品制造|其他针织品及编织品制造');
$cate2[300006] = array('name' => "纺织服装、服饰业", 'keyword' => '纺织服装制造|纺织面料鞋的制造|制帽');
$cate2[300007] = array('name' => "皮革、毛坯、羽毛及其制品和制鞋业", 'keyword' => '皮革鞣制加工|皮革制品制造|皮鞋制造|皮革服装制造|皮箱、包（袋）制造|皮手套及皮装饰制品制造|其他皮革制品制造|毛皮鞣制及制品加工|毛皮鞣制加工|毛皮服装加工|其他毛皮制品加工|羽毛（绒）制品加工及制品制造|羽毛（绒）加工|羽毛（绒）制品加工');
$cate2[300008] = array('name' => "木材加工及木、竹、藤、棕、草制品业", 'keyword' => '锯材、木片加工|锯材加工|木片加工|人造板制造|胶合板制造|纤维板制造|刨花板制造|其他人造板材制造|木制品制造|建筑用木料及木材组件加工|木容器制造|软木制品及其他木制品制造|竹、藤、棕、草制品制造');
$cate2[300009] = array('name' => "家具制造业", 'keyword' => '家具制造|木质家具制造|竹、藤家具制造|金属家具制造|塑料家具制造|其他家具制造');
$cate2[300010] = array('name' => "造纸及纸制品业", 'keyword' => '纸浆制造|造纸|机制纸及纸板制造|手工纸制造|加工纸制造|纸制品制造|纸和纸板容器的制造|其他针织品的制造');
$cate2[300011] = array('name' => "印刷和记录媒介复制业", 'keyword' => '印刷|书、报、刊印刷|本册印刷|包装装潢及其他印刷|装订及其他印刷服务活动|记录媒介的复制');
$cate2[300012] = array('name' => "文教、工美、体育和娱乐用品制造业", 'keyword' => '文化用品制造|文具制造|笔的制造|教学用模型及教具制造|墨水、墨汁制造|其他文化用品制造|体育用品制造|球类制造|体育器材及配件制造|训练健身器材制造|运动防护用具制造|其他体育用品制造|乐器制造|中乐器制造|西乐器制造|电子乐器制造|其他乐器及零件制造|玩具制造|游艺器材及娱乐用品制造|露天游乐场所游乐设施制造|游艺用品及室内游艺器材制造');
$cate2[300013] = array('name' => "石油加工、炼焦和核燃料加工业", 'keyword' => '精炼石油产品的制造|原油加工及石油制品制造|人工原油生产|炼焦|核燃料加工');
$cate2[300014] = array('name' => "化学原料和化学制品制造业", 'keyword' => '基础化学原料制造|无机酸制造|无机碱制造|无机盐制造|有机化学原料制造|其他基础化学原料制造|肥料制造|氮肥制造|磷肥制造|钾肥制造|复混肥料制造|有机肥料及微生物肥料制造|其他肥料制造|农药制造|化学农药制造|生物化学农药及微生物农药制造|涂料、油墨、颜料及类似产品制造|涂料制造|油墨及类似产品制造|颜料制造|染料制造|密封用填料及类似品制造|合成材料制造|初级形态的塑料及合成树脂制造|合成橡胶制造|合成纤维单（聚合）体的制造|其他合成材料制造|专用化学产品制造|化学试剂和助剂制造|专项化学用品制造|林产化学产品制造');
$cate2[300015] = array('name' => "医药制造业", 'keyword' => '化学药品原料制造|化学药品制剂制造|中药饮片加工|中成药制造|兽用药品制造|生物、生化制品的制造|卫生材料及医药用品制造');
$cate2[300016] = array('name' => "化学纤维制造业", 'keyword' => '纤维素纤维原料及纤维制造|化纤浆粕制造|人造纤维（纤维素纤维）制造|合称纤维制造|锦纶纤维制造|涤纶纤维制造|腈纶纤维制造|维纶纤维制造|其他合称纤维制造');
$cate2[300017] = array('name' => "橡胶和塑料制品业", 'keyword' => '轮胎制造|车辆、飞机及工程机械轮胎制造|力车胎制造|轮胎翻新加工|橡胶板、管、带的制造|橡胶零件制造|再生橡胶制造|日用及医用橡胶制造|橡胶靴鞋制造|其他橡胶制品制造');
$cate2[300018] = array('name' => "非金属矿物制品业", 'keyword' => '水泥、石灰和石膏的制造|水泥的制造|石灰和石膏的制造|水泥及石膏制造品制造|水泥制品制造|砼结构构件制造|石棉水泥制品制造|轻质建筑材料制造|其他水泥制品制造|砖瓦、石材及其他建筑材料制造|粘土砖瓦及其他建筑材料制造|建筑陶瓷制品制造|建筑用石加工|防水建筑材料制造|隔热和隔音材料制造|其他建筑材料制造|玻璃及玻璃制品制造|平板玻璃制造|技术玻璃制品制造|光学玻璃制造|玻璃仪器制造|日用玻璃制品及玻璃包装容器制造|玻璃保温容器制造|玻璃纤维及制品制造|玻璃纤维增强塑料制品制造|其他玻璃制品制造');
$cate2[300019] = array('name' => "黑色金属冶炼及压延加工业", 'keyword' => '炼铁|炼钢|钢压延加工|铁合金冶炼');
$cate2[300020] = array('name' => "有色金属冶炼及压延加工业", 'keyword' => '常用有色金属冶炼|铜冶炼|铅锌冶炼|镍钴冶炼|锡冶炼|锑冶炼|铝冶炼|镁冶炼|其他常用有色金属冶炼|贵金属冶炼|金冶炼|银冶炼|其他贵金属冶炼|稀有稀土金属冶炼|钨钼冶炼|稀土金属冶炼|其他稀有金属冶炼|有色金属合金制造|有色金属压延加工|常用有色金属压延加工|贵金属压延加工|稀有稀土金属压延加工');
$cate2[300021] = array('name' => "金属制品业", 'keyword' => '结构性金属制品制造|金属结构制造|金属门窗制造|金属工具制造|切削工具制造|手工具制造|农用及园林用金属工具制造|刀剪及类似日用金属工具制造|其他金属工具制造|集装箱及金属包装容器制造|集装箱制造|金属压力容器制造|金属包装容器制造|金属丝绳及其制品的制造|建筑、安全用金属制品制造|建筑、家具用金属配件制造|建筑装饰及水暖管道零件制造|安全、消防用金属制品制造|其他建筑、安全用金属制品制造|金属表面处理及热处理加工|搪瓷制品制造|工业生产配套用搪瓷制品制造|搪瓷卫生洁具制造|搪瓷日用品及其他搪瓷制品制造|不锈钢及类似日用金属制品制造|金属制厨房调理及卫生器具制造|金属制厨房器皿及餐具制造|其他日用金属制品制造|其他金属制品制造|铸币及贵金属制实验室用品制造|其他未列明的金属制品制造');
$cate2[300022] = array('name' => "通用设备制造业", 'keyword' => '锅炉及原动机制造|锅炉及辅助设备制造|内燃机及配件制造|汽轮机及辅机制造|水轮机及辅机制造|其他原动机制造|金属加工机械制造|金属切割机床制造|金属成形机床制造|铸造机械制造|金属切割及焊接设备制造机床附件制造|其他金属加工器械制造|起重运输设备制造|泵、阀门、压缩机及类似机械的制造|泵及真空设备制造|气体压缩机械制造|阀门和旋塞的制造|液压和气压动力机械及元件的制造|轴承、齿轮、传动和驱动部件的制造|轴承制造|齿轮、传动和驱动部件制造|烘炉、熔炉及电炉制造|风机、衡器、包装设备等通用设备制造|风机、风扇制造|气体、液体分离及纯净设备制造|制冷、空调设备制造|风动和电动工具制造|喷枪及类似器具制造|包装专用设备制造|衡器制造|其他通用设备制造|通用零部件制造及机械修理|金属密封件制造|紧固件、弹簧制造|机械零部件加工及设备修理');
$cate2[300023] = array('name' => "专用设备制造业", 'keyword' => '矿山、冶金、建筑专用设备制造|采矿、采石设备制造|石油钻采专用设备制造|建筑工程用机械制造|建筑材料生产专用机械制造|冶金专用设备制造|化工、木材、非金属加工专用设备制造|炼油、化工生产专用设备制造|橡胶加工专用设备制造|塑料加工专用设备制造|木材加工专用设备制造|模具制造|其他非金属加工专用设备制造|食品、饮料、烟草及饲料生产专用设备制造|食品、饮料、烟草工业专用设备制造|农副食品加工专业制造|饲料生产专用设备制造|印刷、制药、日用化工专用设备制造|制浆和造纸专用设备制造|印刷专用设备制造|日用化工专用设备制造|制药专用设备制造|照明器具生产专用设备制造|玻璃、陶瓷和搪瓷制品生产专用设备制造|其他日用品专用设备制造|纺织、服装和皮革工业专用设备制造|纺织专用设备制造|皮革、毛皮及其制品加工专用设备制造|缝纫机械制造|其它服装加工专用设备制造|电子合电工机械专用设备制造|电工机械专用设备制造|电子工业专用设备制造|武器弹药制造|航空、航天及其他专用设备制造|农、林、牧、渔专用机械制造');
$cate2[300024] = array('name' => "汽车制造业", 'keyword' => '汽车整车制造|改装汽车制造|低速载货汽车制造|电车制造|汽车车身、挂车制造|汽车零部件及配件制造');
$cate2[300025] = array('name' => "铁路、船舶、航空航天和其他运输设备制造业", 'keyword' => '铁路运输设备制造|铁路机车车辆及动车组制造|窄轨机车车辆制造|铁路机车车辆配件制造|铁路专用设备及器材、配件制造|其他铁路运输设备制造|城市轨道交通设备制造|船舶及相关装置制造|金属船舶制造|非金属船舶制造|娱乐船和运动船制造|船用配套设备制造|船舶改装与拆除|航标器材及其他相关装置制造|航空、航天器及设备制造|飞机制造|航天器制造|航空、航天相关设备制造|其他航空航天器制造|摩托车制造|摩托车整车制造|摩托车零部件及配件制造|自行车制造|脚踏自行车及残疾人座车制造|助动自行车制造|非公路休闲车及零配件制造|潜水救捞及其他未列明运输设备制造|潜水及水下救捞装备制造|其他未列明运输设备制造');
$cate2[300026] = array('name' => "电气机械及器材制造业", 'keyword' => '电机制造|发电机及发电机组制造|电动机制造|微电机及其他电机制造|输配电及控制设备制造|变压器、电感器和整流器制造|电容器及其配套设施制造|配电开关控制设备制造|电力电子元器件制造|其他输配电及控制设备制造|电线、电缆、光缆及电工器材制造|电线、电缆制造|光纤、光缆制造|绝缘制品制造|其他电工器材制造|电池制造|家用电力器具制造|家用制冷电器具制造|家用空气调节器制造|家用通风电器具制造|家用厨房电器具制造|家用清洁卫生电器具制造|家用美容、保健电器具制造|家用电力器具专用配件制造|其他家用电力器具制造|非电力家用器具制造|燃气、太阳能及类似能源的器具制造|其他非电力家用器具制造|照明器具制造|电光源制造|照明灯具制造|灯用电器附件及其他照明器具制造|其他电器机械及器材制造|车辆专用照明及电气信号设备装置制造|其他未列明的电气机械制造');
$cate2[300027] = array('name' => "计算机、通信和其他电子设备制造业", 'keyword' => '通信设备制造|通信传输设备制造|通信交换设备制造|通信终端设备制造|移动通信及终端设备制造|其他通信设备制造|雷达及配套设备制造|广播电视设备制造|广播电视节目制作及发射设备制造|广播电视接收设备及器材制造|应用电视设备及其他广播电视设备制造|电子计算机制造|电子计算机整机制造|计算机网络设备制造|电子计算机外部设备制造|电子器件制造|电子真空器件制造|半导体分立器件制造|集成电路制造|光电子器件及其他电子器件制造|电子元件制造|电子元件及组件制造|印刷电路板制造|家用视听设备制造|家用影视设备制造|家用音响设备制造|其他电子设备制造');
$cate2[300028] = array('name' => "仪器仪表制造业", 'keyword' => '通用仪器仪表制造|工业自动控制系统装置制造|电工仪器仪表制造|绘图、计算及测量仪器制造|实验分析仪器制造|试验机制造|供应用仪表及其他仪器制造|专用仪器仪表制造|环境监测专用仪器仪表制造|汽车及其他用计数仪表制造|导航、气象及海洋专用仪器制造|农林牧渔专用仪器仪表制造|地质勘探和地震专用仪器制造|教学专用仪器制造|核子及核辐射测量仪器制造|电子测量仪器制造|其他专用仪器制造|钟表与计时仪器制造|光学仪器及眼镜制造|光学仪器制造|眼镜制造|文化、办公用机械制造|电影机械制造|幻灯及投影设备制造|照相机及器材制造|复印和胶印设备制造|计算器及货币专用设备制造|其他文化、办公用机械制造|其他仪器仪表的制造及修理');
$cate2[300029] = array('name' => "其他制造业", 'keyword' => '工艺美术品制造|雕塑工艺品制造|金属工艺品制造|漆器工艺品制造|花画工艺品制造|天然植物纤维编织工艺品制造|抽纱刺绣工艺品制造|地毯、挂毯制造|珠宝首饰及有关物品的制造|其他工艺美术品制造|日用杂品制造|制镜及类似品加工|鬃毛加工、制刷及清扫用具的制造|其他日用杂品制造|煤制品制造|核辐射加工|其他未列明的制造业');
$cate2[300030] = array('name' => "废弃资源综合利用业", 'keyword' => '金属废料和碎屑的加工处理|非金属废料和碎屑的加工处理');
$cate2[300031] = array('name' => "金属制品、机械和设备修理业", 'keyword' => '金属制品修理|通用设备修理|专用设备修理|铁路、船舶、航空航天等运输设备修理|铁路运输设备修理|船舶修理|航空航天器修理|其他运输设备修理|电气设备修理|仪器仪表修理|其他机械和设备修理业');

$cate2[400001] = array('name' => "电力、热力的生产和供应业", 'keyword' => '电力生产|火力发电|水力发电|核力发电|风力发电|太阳能发电|其他能源发电|电力供应|热力生产和供应');
$cate2[400002] = array('name' => "燃气生产和供应业", 'keyword' => '燃气生产和供应业');
$cate2[400003] = array('name' => "水的生产和供应业", 'keyword' => '水的生产和供应业|自来水的生产和供应|污水处理及其再生利用|其他水的处理、利用与分配');

$cate2[500001] = array('name' => "房屋建筑业", 'keyword' => '房屋建筑业');
$cate2[500002] = array('name' => "土木工程建筑业", 'keyword' => '铁路、道路、隧道和桥梁工程建筑|铁路工程建筑|公路工程建筑|市政道路工程建筑|其他道路、隧道和桥梁工程建筑|水利和内河港口工程建筑|水源及供水设施工程建筑|河湖治理及防洪设施工程建筑|港口及航运设施工程建筑|海洋工程建筑|工矿工程建筑|架线和管道工程建筑|架线及设备工程建筑|管道工程建筑|其他土木工程建筑');
$cate2[500003] = array('name' => "建筑安装业", 'keyword' => '电气安装|管道和设备安装|其他建筑安装业');
$cate2[500004] = array('name' => "建筑装饰和其他建筑业", 'keyword' => '建筑装饰业|工程准备活动|建筑物拆除活动|其他工程准备活动|提供施工设备服务|其他未列明建筑业');

$cate2[600001] = array('name' => "批发业", 'keyword' => '农畜产品批发|谷物、豆及薯类批发|种子、饲料批发|棉、麻批发|牲畜批发|其他农畜产品批发|食品、饮料及烟草制品批发|米、面制品及食用油批发|糕点、糖果及糖批发|果品、蔬菜批发|肉、禽、蛋及水产品批发|盐及调味品批发|饮料及茶叶批发|烟草制品批发|其他食品批发|纺织、服装及日用品批发|纺织品、针织品及原料批发|服装批发|鞋帽批发|厨房、卫生间用具及日用杂货批发|化妆品及卫生用品批发|其他日用品批发|文化、体育用品及器材批发|文具用品批发|体育用品批发|图书批发|报刊批发|音像制品及电子出版物批发|首饰、工艺品及收藏品批发|其他文化用品批发');
$cate2[600002] = array('name' => "零售业", 'keyword' => '综合零售|百货零售|超级市场零售|其他综合零售|食品、饮料及烟草制品专门零售|粮油零售|糕点、面包零售|果品、蔬菜零售|肉、禽、蛋及水产品零售|饮料及茶叶零售|烟草制品零售|其他食品零售|纺织、服装及日用品专门零售|纺织品及针织品零售|服装零售|鞋帽零售|钟表、眼镜零售|化妆品及卫生用品零售|其他日用品零售|文化、体育用品及器材专门零售|文具用品零售|体育用品零售|图书零售|报刊零售|音像制品及电子出版物零售|珠宝首饰零售|工艺美术品及收藏品零售|照相器材零售|其他文化用品零售|医药及医疗器材专门零售|药品零售|医疗用品及器材零售|汽车、摩托车、燃料及零配件专卖零售|汽车零售|汽车零配件零售|摩托车及零配件零售');

$cate2[700001] = array('name' => "铁路运输业", 'keyword' => '铁路运输业|铁路旅客运输|铁路货物运输|铁路运输辅助活动|客运火车站|货运火车站|其他铁路运输辅助活动');
$cate2[700002] = array('name' => "道路运输业", 'keyword' => '道路运输业|公路运输客运|道路运输货运|道路运输辅助活动|客运汽车站|公路管理与养护|其他道路运输辅助活动');
$cate2[700003] = array('name' => "航空运输业", 'keyword' => '航空运输业|航空客货运输|航空旅客运输|航空货物运输|通用航空服务|航空运输辅助活动|机场|空中交通管理|其他航空运输辅助活动');
$cate2[700004] = array('name' => "管道运输业", 'keyword' => '管道运输业');
$cate2[700005] = array('name' => "装卸搬运和运输代理业", 'keyword' => '装卸搬运|运输代理业|货物运输代理|旅客票务代理|其他运输代理业');
$cate2[700006] = array('name' => "仓储业", 'keyword' => '谷物、棉花等农产品仓储|谷物仓储|棉花仓储|其他农产品仓储|其他仓储业');
$cate2[700007] = array('name' => "邮政业", 'keyword' => '邮政基本服务|快递服务');
$cate2[700008] = array('name' => "水上运输业", 'keyword' => '水上运输|海运');

$cate2[800001] = array('name' => "住宿业", 'keyword' => '住宿业|旅游饭店|一般旅店|其他住宿服务');
$cate2[800002] = array('name' => "餐饮业", 'keyword' => '餐饮业|正餐服务|快餐服务|饮料及冷饮服务|茶馆服务|咖啡馆服务|酒吧服务|其他饮料及冷饮服务|其他餐饮业|小吃服务|餐饮配送服务|其他未列明餐饮业');

$cate2[900001] = array('name' => "电信、广播电视和卫星传输服务", 'keyword' => '电信|固定电信服务|移动电信服务|其他电信服务|广播电视传输服务|有线广播电视传输服务|无线广播电视传输服务|卫星传输服务');
$cate2[900002] = array('name' => "互联网和相关服务", 'keyword' => '互联网和相关服务|互联网接入及相关服务|互联网信息服务|其他互联网服务');
$cate2[900003] = array('name' => "软件和信息技术服务业", 'keyword' => '软件和信息技术服务业|软件开发|信息系统集成服务|信息技术咨询服务|数据处理和存储服务|集成电路设计|其他信息技术服务业|数字内容服务|呼叫中心|其他未列明信息技术服务业');

$cate2[1001001] = array('name' => "货币金融服务", 'keyword' => '货币金融服务|中央银行服务|货币银行服务|非货币银行服务|金融租赁服务|财务公司|典当|其他非货币银行服务|银行监管服务');
$cate2[1001002] = array('name' => "资本市场服务", 'keyword' => '资本市场服务|证券市场服务|证券市场管理服务|证券经纪交易服务|基金管理服务|期货市场服务|期货市场管理服务|其他期货市场服务|证券期货监管服务|资本投资服务|其他资本市场服务');
$cate2[1001003] = array('name' => "保险业", 'keyword' => '保险业|人身保险|人寿保险|健康和意外保险|财产保险|再保险|养老金|保险经纪与代理服务|保险监管服务|其他保险活动|风险和损失评估|其他未列明保险活动');
$cate2[1001004] = array('name' => "其他金融业", 'keyword' => '其他金融业|金融信托与管理服务|控股公司服务|非金融机构支付服务|金融信息服务|其他未列明金融业');

$cate2[110001] = array('name' => "房地产业", 'keyword' => '房地产开发经营|物业管理|房地产中介服务|自有房地产经营活动|其他房地产业');

$cate2[120001] = array('name' => "租赁业", 'keyword' => '租赁业|机械设备租赁|汽车租赁|农业机械租赁|建筑工程机械与设备租赁|计算机及通讯设备租赁|其他机械与设备租赁|文化及日用品出租|娱乐及体育设备出租|图书出租|音像制品出租|其他文化及日用品出租');
$cate2[120002] = array('name' => "商务服务业", 'keyword' => '商务服务业|企业管理服务|企业总部管理|投资与资产管理|单位后勤管理服务|其他企业管理服务|法律服务|律师及相关法律服务|公证服务|其他法律服务|咨询与调查|会计、审计及税务服务|市场调查|社会经济咨询|其他专业咨询|广告业|知识产权服务|人力资源服务|公共就业服务|职业中介服务|劳务派遣服务|其他人力资源服务|旅行社及相关服务|旅行社服务|旅游管理服务|其他旅行社相关服务|安全保护服务|安全服务|安全系统监控服务|其他安全保护服务|其他商务服务业|市场管理|会议及展览服务|包装服务|办公服务|信用服务');


$cate2[130001] = array('name' => "研究和试验发展", 'keyword' => '研究和试验发展|自然科学研究和试验发展|工程和技术研究和试验发展|农业科学研究和试验发展|医学研究和试验发展|社会人文科学研究');
$cate2[130002] = array('name' => "专业技术服务业", 'keyword' => '专业技术服务业|气象服务|地震服务|海洋服务|测绘服务|质检技术服务|环境与生态监测|环境保护监测|生态监测|地质勘查|能源矿产地质勘查|固体矿产地质勘查|水、二氧化碳等矿产地质勘查|基础地质勘查|地质勘查技术服务|工程技术|工程管理服务|工程勘察设计|规划管理|其他专业技术服务业|专业化设计服务|摄影扩印服务|兽医服务|其他未列明专业技术服务业');
$cate2[130003] = array('name' => "科技推广和应用服务业", 'keyword' => '科技推广服务业|应用服务业|技术推广服务|农业技术推广服务|生物技术推广服务|新材料技术推广服务|节能技术推广服务|其他技术推广服务|科技中介服务|其他科技推广和应用服务业|水利、环境和公共设施管理业');

$cate2[140001] = array('name' => "水利管理业", 'keyword' => '水利管理业|防洪除涝设施管理|水资源管理|天然水收集与分配|水文服务|其他水利管理业');
$cate2[140002] = array('name' => "生态保护和环境治理业", 'keyword' => '生态保护和环境治理业|生态保护|自然保护区管理|野生动物保护|野生植物保护|其他自然保护|环境治理业|水污染治理|大气污染治理|固体废物治理|危险废物治理|放射性废物治理|其他污染治理');
$cate2[140003] = array('name' => "公共设施管理业", 'keyword' => '公共设施管理业|市政设施管理|环境卫生管理|城乡市容管理|绿化管理|公园和游览景区管理|公园管理|游览景区管理|居民服务、修理和其他服务业');


$cate2[150001] = array('name' => "居民服务业", 'keyword' => '居民服务业|家庭服务|托儿所服务|洗染服务|理发及美容服务|洗浴服务|保健服务|婚姻服务|殡葬服务|其他居民服务业');
$cate2[150002] = array('name' => "机动车、电子产品和日用产品修理业", 'keyword' => '机动车、电子产品和日用产品修理业|汽车、摩托车修理与维护|汽车修理与维护|摩托车修理与维护|计算机和办公设备维修|计算机和辅助设备修理|通讯设备修理|其他办公设备维修|家用电器修理|家用电子产品修理|日用电器修理|其他日用产品修理业|自行车修理|鞋和皮革修理|家具和相关物品修理|其他未列明日用产品修理业');
$cate2[150003] = array('name' => "其他服务业", 'keyword' => '其他服务业|清洁服务|建筑物清洁服务|其他清洁服务|其他未列明服务业|教育');

$cate2[160001] = array('name' => "教育", 'keyword' => '教育|学前教育|初等教育|普通小学教育|成人小学教育|中等教育|普通初中教育|职业初中教育|成人初中教育|普通高中教育|成人高中教育|中等职业学校教育|高等教育|普通高等教育|成人高等教育|特殊教育|技能培训、教育辅助及其他教育|职业技能培训|体校及体育培训|文化艺术培训|教育辅助服务|其他未列明教育|卫生和社会工作');

$cate2[170001] = array('name' => "卫生", 'keyword' => '卫生|医院|综合医院|中医医院|中西医结合医院|民族医院|专科医院|疗养院|社区医疗与卫生院|社区卫生服务中心|街道卫生院|乡镇卫生院|门诊部|门诊所|计划生育技术服务活动|妇幼保健院|专科疾病防治院|疾病预防控制中心|其他卫生活动');
$cate2[170002] = array('name' => "社会工作", 'keyword' => '社会工作|提供住宿社会工作|干部休养所|护理机构服务|精神康复服务|老年人、残疾人养护服务|孤残儿童收养和庇护服务|其他提供住宿社会救助|不提供住宿社会工作|社会看护与帮助服务|其他不提供住宿社会工作|文化、体育和娱乐业');

$cate2[180001] = array('name' => "新闻和出版业", 'keyword' => '新闻和出版业|新闻业|出版业|图书出版|报纸出版|期刊出版|音像制品出版|电子出版物出版|其他出版业');
$cate2[180002] = array('name' => "广播、电视、电影和音像业", 'keyword' => '广播、电视、电影和影视录音制作业|广播|电视|电影和影视节目制作|电影和影视节目发行|电影放映|录音制作');
$cate2[180003] = array('name' => "文化艺术业", 'keyword' => '文化艺术业|文艺创作与表演|艺术表演场馆|图书馆与档案馆|图书馆|档案馆|文物及非物质文化遗产保护|博物馆|烈士陵园、纪念馆|群众文化活动|其他文化艺术业');
$cate2[180004] = array('name' => "体育", 'keyword' => '体育|体育组织|体育场馆|休闲健身活动|其他体育');
$cate2[180005] = array('name' => "娱乐业", 'keyword' => '娱乐业|室内娱乐活动|歌舞厅娱乐活动|电子游艺厅娱乐活动|网吧活动|其他室内娱乐活动|游乐园|彩票活动|文化、娱乐、体育经纪代理|文化娱乐经纪人|体育经纪人|其他文化艺术经纪代理|其他娱乐业|公共管理、社会保障和社会组织');

$cate2[190001] = array('name' => "中国共产党机关", 'keyword' => '中国共产党机关');
$cate2[190002] = array('name' => "国家机构", 'keyword' => '国家机构|国家权力机构|国家行政机构|综合事务管理机构|对外事务管理机构|公共安全管理机构|社会事务管理机构|经济事务管理机构|行政监督检查机构|人民法院和人民检察院|人民法院|人民检察院|其他国家机构');
$cate2[190003] = array('name' => "人民政协、民主党派", 'keyword' => '人民政协|民主党派');
$cate2[190004] = array('name' => "社会保障", 'keyword' => '社会保障');
$cate2[190005] = array('name' => "群众团体、社会团体和其他成员组织", 'keyword' => '群众团体|工会|妇联|共青团|其他群众团体|社会团体|专业性团体|行业性团体|其他社会团体|基金会|宗教组织');
$cate2[190006] = array('name' => "基层群众自治组织", 'keyword' => '基层群众自治组织|社区自治组织|村民自治组织');

$cate2[200001] = array('name' => "国际组织", 'keyword' => '国际组织');


$qccCate1 = array(
    'A' => 100000,
    'B' => 200000,
    'C' => 300000,
    'D' => 400000,
    'E' => 500000,
    'F' => 600000,
    'G' => 700000,
    'H' => 800000,
    'I' => 900000,
    'J' => 101000,
    'K' => 110000,
    'L' => 120000,
    'M' => 130000,
    'N' => 140000,
    'O' => 150000,
    'P' => 160000,
    'Q' => 170000,
    'R' => 180000,
    'S' => 190000,
);
$qccCate2 = array(
    1 => 100001,
    2 => 100002,
    3 => 100003,
    4 => 100004,
    5 => 100005,
    6 => 200001,
    7 => 200002,
    8 => 200003,
    9 => 200004,
    10 => 200005,
    11 => 200006,
    12 => 200007,
    13 => 300001,
    14 => 300002,
    15 => 300003,
    16 => 300004,
    17 => 300005,
    18 => 300006,
    19 => 300007,
    20 => 300008,
    21 => 300009,
    22 => 300010,
    23 => 300011,
    24 => 300012,
    25 => 300013,
    26 => 300014,
    27 => 300015,
    28 => 300016,
    29 => 300017,
    30 => 300018,
    31 => 300019,
    32 => 300020,
    33 => 300021,
    34 => 300022,
    35 => 300023,
    36 => 300024,
    37 => 300025,
    38 => 300026,
    39 => 300027,
    40 => 300028,
    41 => 300029,
    42 => 300030,
    43 => 300031,
    44 => 400001,
    45 => 400002,
    46 => 400003,
    47 => 500001,
    48 => 500002,
    49 => 500003,
    50 => 500004,
    51 => 600001,
    52 => 600002,
    53 => 700001,
    54 => 700002,
    55 => 700008,
    56 => 700003,
    57 => 700004,
    58 => 700005,
    59 => 700006,
    60 => 700007,
    61 => 800001,
    62 => 800002,
    63 => 900001,
    64 => 900002,
    65 => 900003,
    66 => 101001,
    67 => 101002,
    68 => 101003,
    69 => 101004,
    70 => 110001,
    71 => 120001,
    72 => 120002,
    73 => 130001,
    74 => 130002,
    75 => 130003,
    76 => 140001,
    77 => 140002,
    78 => 140003,
    79 => 150001,
    80 => 150002,
    81 => 150003,
    82 => 160001,
    83 => 170001,
    84 => 170002,
    85 => 180001,
    86 => 180002,
    87 => 180003,
    88 => 180004,
    89 => 180005,
    90 => 190001,
    91 => 190002,
    92 => 190003,
    93 => 190004,
    94 => 190005,
    95 => 190006,
);